
## Plan Result (stg)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_postgresql_flexible_server.postgresql_flexible_server_restore[0]
* Update
  * azurerm_postgresql_flexible_server.postgresql_flexible_server_temp_restore[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_postgresql_flexible_server.postgresql_flexible_server_restore[0] will be created
  + resource "azurerm_postgresql_flexible_server" "postgresql_flexible_server_restore" {
      + administrator_login               = (known after apply)
      + auto_grow_enabled                 = false
      + backup_retention_days             = (known after apply)
      + create_mode                       = "PointInTimeRestore"
      + delegated_subnet_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql"
      + fqdn                              = (known after apply)
      + geo_redundant_backup_enabled      = false
      + id                                = (known after apply)
      + location                          = "uksouth"
      + name                              = "toffee-v14-flexible-restore-stg"
      + point_in_time_restore_time_in_utc = (known after apply)
      + private_dns_zone_id               = (known after apply)
      + public_network_access_enabled     = false
      + resource_group_name               = "toffee-v14-flexible-data-stg"
      + sku_name                          = "GP_Standard_D2s_v3"
      + source_server_id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-restore-temp-stg"
      + storage_mb                        = 65536
      + storage_tier                      = (known after apply)
      + tags                              = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "Platform Operations"
        }
      + version                           = (known after apply)

      + authentication (known after apply)
    }

  # azurerm_postgresql_flexible_server.postgresql_flexible_server_temp_restore[0] will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgresql_flexible_server_temp_restore" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/toffee-v14-flexible-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-restore-temp-stg"
        name                              = "toffee-v14-flexible-restore-temp-stg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git" -> null
            "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
            "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = null
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Platform Operations"
        }
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":648,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->